# 1 Створити 2 змінні з однаковими даними (і однаковим типом) та з однаковими ідентифікаторами
# (не присвоюючи значення змінних один одному)
a1 = 'abc'
a2 = 'abc'
print(a1 == a2)                 # should be True
print(a1 is a2, end='\n\n')     # should be True

# 2. Створити 2 змінні з однаковими даними (і однаковим типом) та з різними ідентифікаторами
b_1 = {1: 2, 3: 4}
b_2 = {1: 2, 3: 4}
print(b_1 == b_2)               # should be True
print(b_1 is b_2, end='\n\n')   # should be False

# 3.*Додаткове необов'язкове завдання:
# Поміняти їх типи так, щоб у 1-х двох змінних стали різні ідентифікатори,
# але при цьому залишилися однакові дані (і однаковим типом), а у 2-х останніх
# стали однакові ідентифікатори та залишилися однакові дані.
# Досягти потрібного результату необхідно лише приведенням типів даних до потрібного.

a1 = list(a1)
a2 = list(a2)
print(a1 == a2)                 # should be True
print(a1 is a2, end='\n\n')     # should be False

b_1 = bool(b_1)
b_2 = bool(b_2)
print(b_1 == b_2)               # should be True
print(b_1 is b_2)               # should be True
